import node_select as ns
import node_select_1 as ns1

data_size = 56900 * 8

keys = ["加利福尼亚", "圣保罗", "伦敦", "新加坡", "悉尼", "首尔", "孟买", "法兰克福", "弗吉尼亚", "俄勒冈", "东京", "中部", "北京"]
prices = [0.04968, 0.06696, 0.04752, 0.05256, 0.05184, 0.05184, 0.04464, 0.04824, 0.04176, 0.04176, 0.05472, 0.04608, 0.15]
max_bandwidth = [250, 262, 228, 242, 259, 253, 243, 255, 233, 250, 251, 242, 109]
speeds =[
    [0, 39, 41, 39, 49, 33, 28, 36, 68, 70, 50, 60, 94],
    [37, 0, 29, 19, 20, 22, 19, 24, 48, 57, 44, 43, 82],
    [44, 5, 0, 39, 25, 27, 55, 159, 46, 44, 46, 46, 82],
    [39, 19, 38, 0, 73, 44, 100, 30, 19, 35, 70, 37, 101],
    [48, 19, 22, 55, 0, 46, 45, 16, 32, 33, 35, 36, 80],
    [14, 21, 13, 33, 42, 0, 38, 21, 29, 25, 40, 22, 98],
    [28, 21, 53, 82, 42, 48, 0, 49, 31, 20, 55, 20, 95],
    [41, 32, 210, 29, 23, 24, 42, 0, 44, 33, 40, 21, 94],
    [109, 60, 61, 24, 33, 36, 30, 52, 0, 70, 42, 66, 69],
    [100, 61, 42, 40, 50, 34, 25, 30, 67, 0, 48, 63, 91],
    [53, 22, 54, 83, 44, 40, 48, 50, 30, 44, 0, 30, 90],
    [62, 33, 35, 38, 47, 40, 25, 30, 60, 75, 44, 0, 80],
    [38, 30, 34, 86, 38, 47, 50, 45, 25, 30, 60, 25, 0]
]
# 修改了部分数据以演示速率达限额的情况

ns1.clear()
print("数据量: %.2f GB\n" % (data_size / 1024 / 8))

def road(source,des):
    ns1.fill_data(keys, prices, max_bandwidth, speeds, source, des)


    # 若要限制数量, 则取列表的前几项
    result1 = ns.speed_required(0)          # 价格最低
    result2 = ns.speed_required(200) # 价格最低，并且有最低速率限制
    result3 = ns.speed_order()             # 速率最快
    time1 = (ns.time(result1, data_size) / 60)
    cost1 = (ns.cost(result1, data_size) / 3600)
    time2 = (ns.time(result2, data_size) / 60)
    cost2 = (ns.cost(result2, data_size) / 3600)
    time3 = (ns.time(result3, data_size) / 60)
    cost3 = (ns.cost(result3, data_size) / 3600)
    return result1, time1, cost1, result2, time2, cost2, result3, time3, cost3
